lib/tasks/import_data.rake

SELECT "training_classes".* FROM "training_classes" WHERE "training_classes"."title" = 'Fundamentals of Software Architecture (Round 1)' LIMIT 1
---
  def import_attendees
    puts "\nImporting attendees..."
    file_path = Rails.root.join('db', 'Data', 'attendees_import.csv')

    return unless File.exist?(file_path)

    CSV.foreach(file_path, headers: true) do |row|
      next if row['name'].blank? || row['name'] == 'ค่าข้อมูล (อย่าลบ)' || row['name'].include?('Mail') || row['name'].include?('FaceBook') || row['name'].include?('Phone')

      class_key = row['class_key']&.strip
      class_title = row['class_title']&.strip

      next if class_title.blank?

      # Find or create training class
      training_class = TrainingClass.find_or_initialize_by(title: class_title)

INSERT INTO "training_classes" ("title", "description", "date", "start_time", "end_time", "location", "max_attendees", "instructor", "created_at", "updated_at", "cost") VALUES ('Fundamentals of Software Architecture (Round 1)', 'Imported from CSV', '2026-03-12', NULL, NULL, 'TBD - To be determined', NULL, NULL, '2026-02-11 04:41:58.918186', '2026-02-11 04:41:58.918186', 0.0) RETURNING "id"
---
          location: "TBD - To be determined",
          description: "Imported from CSV"
        )
        training_class.save!

SELECT "attendees".* FROM "attendees" WHERE "attendees"."training_class_id" = 4 AND "attendees"."email" = 'passkornchoosuk@gmail.com' AND "attendees"."training_class_id" = 4 LIMIT 1
SELECT "attendees".* FROM "attendees" WHERE "attendees"."training_class_id" = 4 AND "attendees"."name" = 'เล็ก เล็ก' AND "attendees"."training_class_id" = 4 AND "attendees"."email" = '@imported.local' LIMIT 1
---

      # Create attendee - use email if available, otherwise use name+class as unique key
      if email.present?
        attendee = training_class.attendees.find_or_initialize_by(
          email: email,
          training_class_id: training_class.id
        )
      else
        # For attendees without email, use name as identifier
        attendee = training_class.attendees.find_or_initialize_by(
          name: name,
          training_class_id: training_class.id,
          email: "#{name.parameterize}@imported.local"
        )

INSERT INTO "attendees" ("training_class_id", "name", "email", "phone", "company", "notes", "created_at", "updated_at", "participant_type", "source_channel", "payment_status", "document_status", "attendance_status", "total_classes", "price", "invoice_no", "due_date") VALUES (4, 'ภาสกร ชูสุก', 'passkornchoosuk@gmail.com', '0859950394', NULL, 'Individual | Confirm: Confirm | Reply: รอชำระเงิน', '2026-02-11 04:41:58.953405', '2026-02-11 04:41:58.953405', 'Indi', 'Mail', 'Pending', NULL, 'No-show', 1, 0.0, NULL, NULL) RETURNING "id"
---
        price: 0.0 # Will be updated from payments/quotations
      )

      if attendee.save

SELECT "attendees".* FROM "attendees" INNER JOIN "training_classes" ON "training_classes"."id" = "attendees"."training_class_id" WHERE (attendees.email = 'charlie_chaper@hotmail.com') AND (training_classes.title LIKE '%Fundamentals of Software Architecture%') ORDER BY "attendees"."id" ASC LIMIT 1
SELECT "attendees".* FROM "attendees" INNER JOIN "training_classes" ON "training_classes"."id" = "attendees"."training_class_id" WHERE (attendees.name = 'Binla Thipsukhum') AND (training_classes.title LIKE '%Fundamentals of Software Architecture%') ORDER BY "attendees"."id" ASC LIMIT 1
SELECT "attendees".* FROM "attendees" INNER JOIN "training_classes" ON "training_classes"."id" = "attendees"."training_class_id" WHERE (attendees.phone = '859950394.0') AND (training_classes.title LIKE '%Refactoring to Functional%') ORDER BY "attendees"."id" ASC LIMIT 1
UPDATE "attendees" SET "updated_at" = '2026-02-11 04:41:59.231508', "payment_status" = 'Paid', "document_status" = 'Receipt', "price" = 4280.0 WHERE "attendees"."id" = 21
---
  def import_payments
    puts "\nImporting payments..."
    file_path = Rails.root.join('db', 'Data', 'payments_import.csv')

    return unless File.exist?(file_path)

    CSV.foreach(file_path, headers: true) do |row|
      next if row['name'].blank? || row['paid_amount'].blank?

      email = row['email']&.strip
      name = row['name']&.strip
      phone = row['phone']&.to_s&.strip
      paid_amount = row['paid_amount']&.to_f || 0
      receipt_no = row['receipt_no']&.strip
      payment_date = parse_date(row['payment_date'])
      description = row['description']&.strip

      # Find attendee by email, name, or phone
      attendee = nil

      if email.present?
        attendee = Attendee.joins(:training_class)
                           .where("attendees.email = ?", email)
                           .where("training_classes.title LIKE ?", "%#{extract_class_from_description(description)}%")
                           .first
      end

      if attendee.nil? && name.present?
        attendee = Attendee.joins(:training_class)
                           .where("attendees.name = ?", name)
                           .where("training_classes.title LIKE ?", "%#{extract_class_from_description(description)}%")
                           .first
      end

      if attendee.nil? && phone.present?
        attendee = Attendee.joins(:training_class)
                           .where("attendees.phone = ?", phone)
                           .where("training_classes.title LIKE ?", "%#{extract_class_from_description(description)}%")
                           .first
      end

      if attendee
        attendee.update(
          payment_status: 'Paid',
          price: paid_amount,
          document_status: receipt_no.present? ? 'Receipt' : (attendee.document_status || 'Receipt')
        )

SELECT "training_classes".* FROM "training_classes" WHERE (title LIKE '%Introduction to Agile and Scrum%') ORDER BY "training_classes"."id" ASC LIMIT 1
---
  def import_quotations_company
    puts "\nImporting company quotations..."
    file_path = Rails.root.join('db', 'Data', 'quotations_company_import.csv')

    return unless File.exist?(file_path)

    CSV.foreach(file_path, headers: true) do |row|
      next if row['company_name'].blank? || row['qt_no'].blank?

      qt_no = row['qt_no']&.strip
      company_name = row['company_name']&.strip
      class_title = row['class_title']&.strip
      amount = row['amount_inc_vat']&.to_f || 0

      # Find training class
      training_class = TrainingClass.where("title LIKE ?", "%#{class_title}%").first