app/controllers/admin/attendees_controller.rb

SELECT "attendees".* FROM "attendees" WHERE "attendees"."training_class_id" = 2 ORDER BY "attendees"."name" ASC
---
    def index
      @attendees = @training_class.attendees.order(:name)

SELECT "training_classes".* FROM "training_classes" WHERE "training_classes"."id" = 1 LIMIT 1
---
    def set_training_class
      @training_class = TrainingClass.find(params[:training_class_id])