app/controllers/admin/dashboard_controller.rb

SELECT COUNT(*) FROM "training_classes"
SELECT COUNT(*) FROM "attendees" INNER JOIN "training_classes" ON "training_classes"."id" = "attendees"."training_class_id" WHERE (training_classes.date >= '2026-02-01')
SELECT COUNT(*) FROM "attendees" WHERE (created_at >= '2026-02-04 04:24:17.688073')
SELECT COUNT(*) FROM "attendees" WHERE "attendees"."training_class_id" = 1
SELECT COUNT(*) FROM "attendees" WHERE "attendees"."document_status" = 'INV' AND "attendees"."payment_status" = 'Pending'
SELECT "training_classes".* FROM "training_classes" WHERE (date >= '2026-02-11') ORDER BY "training_classes"."date" ASC
SELECT "attendees".* FROM "attendees" WHERE "attendees"."training_class_id" IN (1, 2)
SELECT COUNT(*) FROM "attendees"
SELECT "attendees".* FROM "attendees" ORDER BY "attendees"."created_at" DESC LIMIT 10
SELECT "training_classes".* FROM "training_classes" WHERE "training_classes"."id" IN (3, 2, 1)
SELECT COUNT(*) AS "count_all", "attendees"."source_channel" AS "attendees_source_channel" FROM "attendees" WHERE (created_at >= '2026-01-11 04:24:17.698216') GROUP BY "attendees"."source_channel"
---
    def index
      # Prevent caching of dashboard data
      response.headers["Cache-Control"] = "no-cache, no-store, must-revalidate"
      response.headers["Pragma"] = "no-cache"
      response.headers["Expires"] = "0"

      # KPI
      @total_upcoming_classes = TrainingClass.upcoming.count
      @total_attendees_this_month = Attendee.attendees.joins(:training_class)
                                            .where("training_classes.date >= ?", Date.today.beginning_of_month)
                                            .count
      @new_leads_this_week = Attendee.where("created_at >= ?", 1.week.ago).count
      @repeat_learners = Attendee.attendees.where("total_classes > ?", 0).distinct.count(:email)

      # Action Required
      @pending_qt = Attendee.attendees.where(document_status: [nil, ""], payment_status: "Pending").count
      @inv_not_confirmed = Attendee.attendees.where(document_status: "INV", payment_status: "Pending").count
      @classes_near_full = TrainingClass.upcoming.select do |tc|
        tc.max_attendees && (tc.attendees.attendees.count.to_f / tc.max_attendees >= 0.9)
      end

      # Upcoming Classes (sorted by date ascending - earliest first)
      # Using the scope which already filters and orders by date
      @upcoming_classes = TrainingClass.upcoming.limit(10).includes(:attendees)

      # Leads by Channel
      @leads_by_channel = Attendee.where("created_at >= ?", 1.month.ago)
                                  .group(:source_channel)
                                  .count