app/controllers/admin/finance_controller.rb

    def index
      # KPI
      @revenue_this_month = calculate_revenue_this_month
      @paid_this_month = calculate_paid_this_month
      @outstanding_invoice = calculate_outstanding_invoice
      @overdue_payments = calculate_overdue_payments

      # Invoice Summary
      @inv_issued_this_month = Attendee.where(document_status: "INV")
                                       .where("created_at >= ?", Date.today.beginning_of_month)
                                       .count
      @inv_unpaid = Attendee.where(document_status: "INV", payment_status: "Pending").count
      @inv_overdue = Attendee.where(document_status: "INV", payment_status: "Pending")
                             .where("due_date < ?", Date.today)
                             .count
      @receipt_not_issued = Attendee.where(payment_status: "Paid")
                                    .where.not(document_status: "Receipt")
                                    .count
---
SELECT COUNT(*) FROM "attendees" WHERE "attendees"."document_status" = 'INV' AND (created_at >= '2026-02-01')
SELECT COUNT(*) FROM "attendees" WHERE "attendees"."document_status" = 'INV' AND "attendees"."payment_status" = 'Pending'
SELECT COUNT(*) FROM "attendees" WHERE "attendees"."document_status" = 'INV' AND "attendees"."payment_status" = 'Pending' AND (due_date < '2026-02-11')
SELECT COUNT(*) FROM "attendees" WHERE "attendees"."payment_status" = 'Paid' AND "attendees"."document_status" != 'Receipt'

    def calculate_revenue_this_month
      Attendee.joins(:training_class)
              .where("training_classes.date >= ? AND training_classes.date <= ?",
                     Date.today.beginning_of_month, Date.today.end_of_month)
              .sum(:price)
---
SELECT SUM("attendees"."price") FROM "attendees" INNER JOIN "training_classes" ON "training_classes"."id" = "attendees"."training_class_id" WHERE (training_classes.date >= '2026-02-01' AND training_classes.date <= '2026-02-28')

    def calculate_paid_this_month
      Attendee.joins(:training_class)
              .where(payment_status: "Paid")
              .where("training_classes.date >= ? AND training_classes.date <= ?",
                     Date.today.beginning_of_month, Date.today.end_of_month)
              .sum(:price)
---
SELECT SUM("attendees"."price") FROM "attendees" INNER JOIN "training_classes" ON "training_classes"."id" = "attendees"."training_class_id" WHERE "attendees"."payment_status" = 'Paid' AND (training_classes.date >= '2026-02-01' AND training_classes.date <= '2026-02-28')

    def calculate_outstanding_invoice
      Attendee.where(document_status: "INV", payment_status: "Pending").sum(:price)
---
SELECT SUM("attendees"."price") FROM "attendees" WHERE "attendees"."document_status" = 'INV' AND "attendees"."payment_status" = 'Pending'

    def calculate_overdue_payments
      Attendee.where(document_status: "INV", payment_status: "Pending")
              .where("due_date < ?", Date.today)
              .sum(:price)
---
SELECT SUM("attendees"."price") FROM "attendees" WHERE "attendees"."document_status" = 'INV' AND "attendees"."payment_status" = 'Pending' AND (due_date < '2026-02-11')

    def calculate_revenue_by_course
      Attendee.joins(:training_class)
              .group("training_classes.title")
              .sum(:price)
---
SELECT SUM("attendees"."price") AS "sum_price", "training_classes"."title" AS "training_classes_title" FROM "attendees" INNER JOIN "training_classes" ON "training_classes"."id" = "attendees"."training_class_id" GROUP BY "training_classes"."title"

    def calculate_revenue_by_type
      {
        "Corp" => Attendee.where(participant_type: "Corp").sum(:price),
        "Indi" => Attendee.where(participant_type: "Indi").sum(:price)
---
SELECT SUM("attendees"."price") FROM "attendees" WHERE "attendees"."participant_type" = 'Indi'

    def calculate_vat_summary
      total_revenue = Attendee.sum(:price)
---
SELECT SUM("attendees"."price") FROM "attendees"

    def calculate_corporate_billing
      Attendee.where(participant_type: "Corp")
              .group(:company)
              .sum(:price)
              .map { |company, amount| { company: company || "Unknown", amount: amount } }
              .sort_by { |item| -item[:amount] }
---
SELECT SUM("attendees"."price") AS "sum_price", "attendees"."company" AS "attendees_company" FROM "attendees" WHERE "attendees"."participant_type" = 'Corp' GROUP BY "attendees"."company"