app/controllers/admin/training_classes_controller.rb

    def show
      @training_class = TrainingClass.find(params[:id])
      @attendees = @training_class.attendees.attendees.includes(:customer).order(:name)
---
SELECT "training_classes".* FROM "training_classes" WHERE "training_classes"."id" = 2 LIMIT 1
SELECT "attendees".* FROM "attendees" WHERE "attendees"."training_class_id" = 2 ORDER BY "attendees"."name" ASC

    def load_training_classes_kpis
      upcoming = TrainingClass.upcoming
      @kpi_upcoming_count = upcoming.count
      # Average fill rate (upcoming classes with max_attendees only)
      with_max = upcoming.select { |tc| tc.max_attendees.present? && tc.max_attendees.positive? }
      @kpi_avg_fill_rate = if with_max.any?
        (with_max.sum { |tc| tc.fill_rate_percent || 0 }.to_f / with_max.size).round(0)
      else
        0
      end
      next_30_end = 30.days.from_now.to_date
      next_30_classes = upcoming.where("date <= ?", next_30_end)
      @kpi_seats_next_30 = next_30_classes.sum { |tc| tc.total_registered_seats }
      @kpi_revenue_forecast = next_30_classes.sum(&:net_revenue)
      past_30_start = 30.days.ago.to_date
      past_30_classes = TrainingClass.past.where("(end_date IS NOT NULL AND end_date >= ?) OR (end_date IS NULL AND date >= ?)", past_30_start, past_30_start)
      @kpi_past_30_revenue = past_30_classes.sum(&:net_revenue)
---
SELECT 1 AS one FROM "attendees" WHERE "attendees"."training_class_id" = 2 LIMIT 1
SELECT 1 AS one FROM "training_classes" LIMIT 1
SELECT COUNT(*) FROM "attendees" WHERE "attendees"."training_class_id" = 2
SELECT "training_classes".* FROM "training_classes" ORDER BY "training_classes"."date" DESC