app/views/admin/dashboard/index.html.erb

                  <%
                    paid_count = training_class.attendees.attendees.where(payment_status: "Paid").count
                    pending_count = training_class.attendees.attendees.where(payment_status: "Pending").count
                    revenue = training_class.attendees.attendees.sum { |a| a.calculate_final_price }
---
SELECT COUNT(*) FROM "attendees" WHERE "attendees"."training_class_id" = 1 AND "attendees"."payment_status" = 'Paid'
SELECT COUNT(*) FROM "attendees" WHERE "attendees"."training_class_id" = 1 AND "attendees"."payment_status" = 'Pending'
SELECT "attendees".* FROM "attendees" WHERE "attendees"."training_class_id" IN (1, 2)
SELECT SUM("attendees"."price") FROM "attendees" WHERE "attendees"."training_class_id" = 1

                    <td>
                      <%= training_class.attendees.attendees.count %>
---
SELECT COUNT(*) FROM "attendees" WHERE "attendees"."training_class_id" = 1

            <% @recent_activity.each do |attendee| %>
              <% next unless attendee.training_class.present? %>
---
SELECT 1 AS one FROM "training_classes" WHERE (date >= '2026-02-11') LIMIT 1