app/controllers/application_controller.rb

  def current_user
    return nil unless session[:admin_user_id].present?
    @current_user ||= AdminUser.find_by(id: session[:admin_user_id])
---
SELECT "admin_users".* FROM "admin_users" WHERE "admin_users"."id" = 1 LIMIT 1