app/views/admin/training_classes/index.html.erb

SELECT COUNT(*) FROM "attendees" WHERE "attendees"."training_class_id" = 2
---
                    <span class="badge bg-info">
                      <i class="bi bi-people"></i> <%= training_class.attendees.attendees.count %>