app/views/admin/training_classes/show.html.erb

          <span class="badge bg-primary" style="font-size: 2rem;">
            <%= @training_class.attendees.count %>
---
SELECT COUNT(*) FROM "attendees" WHERE "attendees"."training_class_id" = 2