app/views/admin/training_classes/show.html.erb

                </div>
                <% if @training_class.max_attendees.present? %>
---
SELECT 1 AS one FROM "attendees" WHERE "attendees"."training_class_id" = 1 LIMIT 1