app/views/admin/training_classes/show.html.erb

SELECT 1 AS one FROM "attendees" WHERE "attendees"."training_class_id" = 2 LIMIT 1
---
                </div>
                <% if @training_class.max_attendees.present? %>